{"MATH 118": {"title": "Mathematical Methods of Data Theory", "description": "Lecture, three hours; discussion, one hour. Requisites: courses 42, 115A. Introduction to computational methods for data problems with focus on linear algebra and optimization. Matrix and tensor factorization, PageRank, assorted other topics in matrices, linear programming, unconstrained optimization, constrained optimization, integer optimization, dynamic programming, and stochastic optimization. P/NP or letter grading.", "pre-reqs": ["MATH 115A", "MATH 42"], "co-reqs": []}, "MATH 115AH": {"title": "Linear Algebra (Honors)", "description": "Lecture, three hours; discussion, two hours. Requisite: course 33A with grade of B or better. Honors course parallel to course 115A. P/NP or letter grading.", "pre-reqs": ["MATH 33A"], "co-reqs": []}, "MATH 115A": {"title": "Linear Algebra", "description": "Lecture, three hours; discussion, two hours. Requisite: course 33A. Techniques of proof, abstract vector spaces, linear transformations, and matrices; determinants; inner product spaces; eigenvector theory. P/NP or letter grading.", "pre-reqs": ["MATH 33A"], "co-reqs": []}, "MATH 110AH": {"title": "Algebra (Honors)", "description": "Lecture, three hours; discussion, one hour. Honors course parallel to course 110A.", "pre-reqs": [], "co-reqs": []}, "MATH 110A": {"title": "Algebra", "description": "Lecture, three hours; discussion, one hour. Requisite: course 115A. Not open for credit to students with credit for course 117. Ring of integers, integral domains, fields, polynomial domains, unique factorization. P/NP or letter grading.", "pre-reqs": ["MATH 115A"], "co-reqs": []}, "MATH 105A": {"title": "Mathematics and Pedagogy for Teaching Secondary School Mathematics", "description": "Lecture, four hours; fieldwork, 30 minutes. Requisites: courses 110A (or 117), 120A (or 123), and 131A, with grades of C- or better. Course 105A is requisite to 105B, which is requisite to 105C. Mathematical knowledge and research-based pedagogy needed for teaching key geometry topics in secondary school, including axiomatic systems, measure, and geometric transformations. Introduction to professional standards and current research for teaching secondary school mathematics. Letter grading.", "pre-reqs": ["MATH 131A", ["MATH 123", "MATH 120A"], ["MATH 110A", "MATH 117"]], "co-reqs": []}, "MATH 101": {"title": "Advanced Problem Solving", "description": "Lecture, three hours. Requisite: course 100 or significant experience with mathematical competitions. Enrollment based on one selection test or past Putnam results. Advanced problem solving techniques and mathematical topics useful as preparation for Putnam competition. Problems in abstract algebra, linear algebra, number theory, combinatorics, probability, real and complex analysis, differential, equations, Fourier analysis. Regular practice tests given, similar in difficulty to Putnam competition. May be repeated for maximum of 12 units. P/NP or letter grading.", "pre-reqs": ["MATH 100"], "co-reqs": []}, "MATH 100": {"title": "Problem Solving", "description": "Lecture, three hours. Requisite: course 31A with grade of C- or better. Problem-solving techniques and mathematical topics useful as preparation for Putnam Examination and similar competitions. Continued fractions, inequalities, modular arithmetic, closed form evaluation of sums and products, problems in geometry, rational functions and polynomials, other nonroutine problems. Participants expected to take Putnam Examination. P/NP grading.", "pre-reqs": ["MATH 31A"], "co-reqs": []}, "MATH 98XB": {"title": "PEERS Collaborative Learning Workshops for Physical Sciences and Engineering Majors", "description": "Laboratory, three hours. Corequisite: associated undergraduate lecture course in mathematics for physical sciences and engineering majors. Limited to Program for Excellence in Education and Research in Science (PEERS) students. Development of intuition and problem-solving skills in collaborative learning environment. May be repeated four times, but only 1 unit may be applied toward graduation. P/NP grading.", "pre-reqs": [], "co-reqs": []}, "MATH 98XA": {"title": "PEERS Collaborative Learning Workshops for Life Sciences Majors", "description": "Laboratory, three hours. Corequisite: associated undergraduate lecture course in mathematics for life sciences majors. Limited to Program for Excellence in Education and Research in Science (PEERS) students. Development of intuition and problem-solving skills in collaborative learning environment. May be repeated four times, but only 1 unit may be applied toward graduation. P/NP grading.", "pre-reqs": [], "co-reqs": []}, "MATH 95": {"title": "Transition to Upper-Division Mathematics", "description": "Lecture, three hours; discussion, one hour. Enforced requisites: courses 32A, 32B. Not open for credit to students with credit for course 131A or 132. Introduction to rigorous methods of proof-based upper-division mathematics courses. Basic logic; structure of mathematical proofs; sets, functions, and cardinality; natural numbers and induction; construction of real numbers; topology of real numbers; sequences and convergence; continuity. May not be applied toward major requirements. P/NP or letter grading.", "pre-reqs": ["MATH 32A", "MATH 32B"], "co-reqs": []}, "MATH 73XP": {"title": "Key Issues in K-12 Mathematics", "description": "(Formerly numbered 73SL.) Seminar, two hours; fieldwork, two hours. Introduction to K-12 mathematics activity in U.S. Cultivation of interest in teaching through exploration of sequences of mathematical content and habits of mind taught in K-12. Analysis of sequences of topics in current California State Standards in Mathematics (CCSS-M), mathematical structures that underlie these sequences, and cognitive aspects of learning mathematics. Experience with professional mathematician's habits of mind outlined in CCSS-M (including proof and mathematical modeling), and effective strategies for teaching mathematics to diverse student groups. Fieldwork in local mathematics classroom arranged by Cal Teach program. P/NP grading.", "pre-reqs": [], "co-reqs": []}, "MATH 61": {"title": "Introduction to Discrete Structures", "description": "Lecture, three hours; discussion, one hour. Requisites: courses 31A, 31B. Not open for credit to students with credit for course 180 or 184. Discrete structures commonly used in computer science and mathematics, including sets and relations, permutations and combinations, graphs and trees, induction. P/NP or letter grading.", "pre-reqs": ["MATH 31A", "MATH 31B"], "co-reqs": []}, "MATH 42": {"title": "Introduction to Data-Driven Mathematical Modeling: Life, Universe, and Everything", "description": "Lecture, three hours; discussion, one hour. Requisites: courses 31A, 31B, 32A, 32B, 33A, one statistics course from Statistics 10, 12, 13, one programming course from Computer Science 31, Program in Computing 10A, Statistics 20. Introduction to data-driven mathematical modeling combing data analysis with mechanistic modeling of phenomena from various applications. Topics include model formulation, data visualization, nondimensionalization and order-of-magnitude physics, introduction to discrete and continuous dynamical systems, and introduction to discrete and continuous stochastic models. Examples drawn from many fields and practice problems from Mathematical Contest in Modeling. P/NP or letter grading.", "pre-reqs": ["MATH 31A", "MATH 31B", "MATH 32A", "MATH 32B", "MATH 33A", ["STATS 10", "STATS 12", "STATS 13"], ["STATS 20", "COMPTNG 10A", "COM SCI 31"]], "co-reqs": []}, "MATH 33B": {"title": "Differential Equations", "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 31B with grade of C- or better. Highly recommended: course 33A. First-order, linear differential equations; second-order, linear differential equations with constant coefficients; power series solutions; linear systems. P/NP or letter grading.", "pre-reqs": ["MATH 31B"], "co-reqs": []}, "MATH 33A": {"title": "Linear Algebra and Applications", "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 3B or 31B or 32A with grade of C- or better. Introduction to linear algebra: systems of linear equations, matrix algebra, linear independence, subspaces, bases and dimension, orthogonality, least-squares methods, determinants, eigenvalues and eigenvectors, matrix diagonalization, and symmetric matrices. P/NP or letter grading.", "pre-reqs": [["MATH 31B", "MATH 32A", "MATH 3B"]], "co-reqs": []}, "MATH 32B": {"title": "Calculus of Several Variables", "description": "Lecture, three hours; discussion, one hour. Enforced requisites: courses 31B and 32A, with grades of C- or better. Introduction to integral calculus of several variables, line and surface integrals. P/NP or letter grading.", "pre-reqs": ["MATH 31B", "MATH 32A"], "co-reqs": []}, "MATH 32AH": {"title": "Calculus of Several Variables (Honors)", "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 31A with grade of B or better. Honors course parallel to course 32A. P/NP or letter grading.", "pre-reqs": ["MATH 31A"], "co-reqs": []}, "MATH 32A": {"title": "Calculus of Several Variables", "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 31A with grade of C- or better. Introduction to differential calculus of several variables, vector field theory. P/NP or letter grading.", "pre-reqs": ["MATH 31A"], "co-reqs": []}, "MATH 31B": {"title": "Integration and Infinite Series", "description": "Lecture, three hours; discussion, one hour. Requisite: course 31A with grade of C- or better. Not open for credit to students with credit for course 3B. Transcendental functions; methods and applications of integration; sequences and series. P/NP or letter grading.", "pre-reqs": ["MATH 31A"], "co-reqs": []}, "MATH 31AL": {"title": "Differential and Integral Calculus Laboratory", "description": "Lecture, three hours; discussion, one hour; laboratory, one hour. Preparation: at least three and one-half years of high school mathematics (including some coordinate geometry and trigonometry). Requisite: successful completion of Mathematics Diagnostic Test or course 1 with grade of C- or better. Not open for credit to students with credit for course 31A. Intended for students who still need to review precalculus material (laboratory) while starting calculus. Differential calculus and applications; introduction to integration. P/NP or letter grading.", "pre-reqs": [["MATH 1", "Math Diagnostic Test and Math Diagnostic Test"]], "co-reqs": []}, "MATH 31A": {"title": "Differential and Integral Calculus", "description": "Lecture, three hours; discussion, one hour. Preparation: at least three and one half years of high school mathematics (including some coordinate geometry and trigonometry). Requisite: successful completion of Mathematics Diagnostic Test or course 1 with grade of C- or better. Differential calculus and applications; introduction to integration. P/NP or letter grading.", "pre-reqs": [["MATH 1", "Math Diagnostic Test"]], "co-reqs": []}, "MATH 11N": {"title": "Gateway to Mathematics: Number Theory", "description": "Lecture, three hours; discussion, one hour. Requisites: courses 31A, 31B. Introductory number theory course for freshmen and sophomores. Topics include prime number theory and cryptographic applications, factorization theory (in integers and Gaussian integers), Pythagorean triples, Fermat descent (for sums of squares and Fermat quartic), Pell's equation, and Diophantine approximation. P/NP or letter grading.", "pre-reqs": ["MATH 31A", "MATH 31B"], "co-reqs": []}, "MATH 3A": {"title": "Calculus for Life Sciences Students", "description": "Lecture, three hours; discussion, one hour. Preparation: three and one half years of high school mathematics (including trigonometry). Enforced requisite: successful completion of Mathematics Diagnostic Test (score of 48 or better) or course 1 with grade of C- or better. Not open for credit to students with credit in another calculus sequence. Modeling with functions, limits, and derivatives, decisions and optimization in biology, derivative rules and tools. P/NP or letter grading.", "pre-reqs": [["MATH 1", "Math Diagnostic Test"]], "co-reqs": []}, "MATH 1": {"title": "Precalculus", "description": "Lecture, three hours; discussion, one hour. Preparation: three years of high school mathematics. Requisite: successful completion of Mathematics Diagnostic Test. Function concept. Linear and polynomial functions and their graphs, applications to optimization. Inverse, exponential, and logarithmic functions. Trigonometric functions. P/NP or letter grading.", "pre-reqs": ["Math Diagnostic Test"], "co-reqs": []}, "MATH 131BH": {"title": "Analysis (Honors)", "description": "Lecture, three hours; discussion, one hour. Honors course parallel to course 131B. P/NP or letter grading.", "pre-reqs": [], "co-reqs": []}, "MATH 131B": {"title": "Analysis", "description": "Lecture, three hours; discussion, one hour. Requisites: courses 33B, 115A, 131A. Derivatives, Riemann integral, sequences and series of functions, power series, Fourier series. P/NP or letter grading.", "pre-reqs": ["MATH 33B", "MATH 115A", "MATH 131A"], "co-reqs": []}, "MATH 131A": {"title": "Analysis", "description": "Lecture, three hours; discussion, one hour. Requisites: courses 32B, 33B. Recommended: course 115A. Rigorous introduction to foundations of real analysis; real numbers, point set topology in Euclidean space, functions, continuity. P/NP or letter grading.", "pre-reqs": ["MATH 32B", "MATH 33B"], "co-reqs": []}, "MATH 120B": {"title": "Differential Geometry", "description": "Lecture, three hours; discussion, one hour. Requisites: courses 32B, 33B, 115A, 120A, 131A. Curves in 3-space, Frenet formulas, surfaces in 3-space, normal curvature, Gaussian curvature, congruence of curves and surfaces, intrinsic geometry of surfaces, isometries, geodesics, Gauss/Bonnet theorem. P/NP or letter grading.", "pre-reqs": ["MATH 32B", "MATH 33B", "MATH 115A", "MATH 120A", "MATH 131A"], "co-reqs": []}, "MATH 120A": {"title": "Differential Geometry", "description": "Lecture, three hours; discussion, one hour. Requisites: courses 32B, 33B, 115A, 131A. Course 120A is requisite to 120B. Curves in 3-space, Frenet formulas, surfaces in 3-space, normal curvature, Gaussian curvature, congruence of curves and surfaces, intrinsic geometry of surfaces, isometries, geodesics, Gauss/Bonnet theorem. P/NP or letter grading.", "pre-reqs": ["MATH 32B", "MATH 33B", "MATH 115A", "MATH 131A"], "co-reqs": []}, "MATH 115B": {"title": "Linear Algebra", "description": "Lecture, three hours; discussion, one hour. Requisite: course 115A. Linear transformations, conjugate spaces, duality; theory of a single linear transformation, Jordan normal form; bilinear forms, quadratic forms; Euclidean and unitary spaces, symmetric skew and orthogonal linear transformations, polar decomposition. P/NP or letter grading.", "pre-reqs": ["MATH 115A"], "co-reqs": []}, "MATH 114L": {"title": "Mathematical Logic", "description": "Lecture, three hours; discussion, one hour. Requisite: course 110A or 131A or Philosophy 135. Introduction to mathematical logic, aiming primarily at completeness and incompleteness theorems of Gödel. Propositional and predicate logic; syntax and semantics; formal deduction; completeness, compactness, and Lowenheim/Skolem theorems. Formal number theory: nonstandard models; Gödel incompleteness theorem. P/NP or letter grading.", "pre-reqs": [["MATH 110A", "MATH 131A", "Philosophy 135"]], "co-reqs": []}, "MATH 111": {"title": "Theory of Numbers", "description": "Lecture, three hours; discussion, one hour. Requisite: courses 110A. Algebraic number theory (including prime ideal theory), cyclotomic fields and reciprocity laws, Diophantine equations (especially quadratic forms, elliptic curves), equations over finite fields, topics in theory of primes, including prime number theorem and Dirichlet's theorem. P/NP or letter grading.", "pre-reqs": ["MATH 110A"], "co-reqs": []}, "MATH 110C": {"title": "Algebra", "description": "Lecture, three hours; discussion, one hour. Requisites: courses 110A, 110B. Field extensions, Galois theory, applications to geometric constructions, and solvability by radicals.", "pre-reqs": ["MATH 110A", "MATH 110B"], "co-reqs": []}, "MATH 110B": {"title": "Algebra", "description": "Lecture, three hours; discussion, one hour. Requisite: course 110A or 117. Groups, structure of finite groups. P/NP or letter grading.", "pre-reqs": [["MATH 110A", "MATH 117"]], "co-reqs": []}, "MATH 106": {"title": "History of Mathematics", "description": "Lecture, three hours; discussion, one hour. Requisites: courses 31A, 31B, 32A. Roots of modern mathematics in ancient Babylonia and Greece, including place value number systems and proof. Development of algebra through Middle Ages to Fermat and Abel, invention of analytic geometry and calculus. Selected topics. P/NP or letter grading.", "pre-reqs": ["MATH 31A", "MATH 31B", "MATH 32A"], "co-reqs": []}, "MATH 105C": {"title": "Mathematics and Pedagogy for Teaching Secondary School Mathematics", "description": "Lecture, four hours; fieldwork, 30 minutes. Requisites: courses 105A, 105B, 110A (or 117), 120A (or 123), and 131A, with grades of C- or better. Mathematical knowledge and research-based pedagogy needed for teaching key analysis, probability, and statistics topics in secondary school; professional standards and current research for teaching secondary school mathematics. Letter grading.", "pre-reqs": ["MATH 131A", ["MATH 123", "MATH 120A"], ["MATH 110A", "MATH 117"], "MATH 105A", "MATH 105B"], "co-reqs": []}, "MATH 75XP": {"title": "Mathematics and Pedagogy for Teaching Middle School Mathematics", "description": "Seminar, two hours; fieldwork, two hours. Facilitates development of professional mathematical and pedagogical understandings required to teach California middle school mathematics curriculum. Exploration of topics in grades six through eight mathematics from professional perspective, practice with effective teaching strategies for all learnings,and discussion of current research and st andards in mathematics education. Clinical practice in local mathematics classrooms arranged by Cal Teach program. P/NP grading.", "pre-reqs": [], "co-reqs": []}, "MATH 70": {"title": "Introduction to Probability", "description": "Lecture, three hours; discussion, one hour. Requisites: courses 31A, 31B. Introduction to probability through applications and examples. Topics include laws of large numbers, statistics, chance trees, conditional probability, Bayes' rule, continuous and discrete random variables, jointly distributed random variables, multivariate normal and conditional distributions. In-depth discussion of betting schemes in gambling, occurrence of rare events, coincidences, and statistical predictions. P/NP or letter grading.", "pre-reqs": ["MATH 31A", "MATH 31B"], "co-reqs": []}, "MATH 3C": {"title": "Ordinary Differential Equations with Linear Algebra for Life Sciences Students", "description": "Lecture, three hours; discussion, one hour. Requisite: course 3B with grade of C- or better. Multivariable modeling, matrices and vectors, eigenvalues and eigenvectors, linear and nonlinear systems of differential equations, probabilistic applications of integration. P/NP or letter grading.", "pre-reqs": ["MATH 3B"], "co-reqs": []}, "MATH 121": {"title": "Introduction to Topology", "description": "Requisite: course 131A. Metric and topological spaces, completeness, compactness, connectedness, functions, continuity, homeomorphisms, topological properties.", "pre-reqs": ["MATH 131A"], "co-reqs": []}, "MATH 114C": {"title": "Computability Theory", "description": "Lecture, three hours; discussion, one hour. Requisite: course 110A or 131A or Philosophy 135. Effectively calculable, Turing computable, and recursive functions; Church/Turing thesis. Normal form theorem; universal functions; unsolvability and undecidability results. Recursive and recursively enumerable sets; relative recursiveness, polynomial-time computability. Arithmetical hierarchy. P/NP or letter grading.", "pre-reqs": [["MATH 110A", "MATH 131A", "Philosophy 135"]], "co-reqs": []}, "MATH 110BH": {"title": "Algebra (Honors)", "description": "Lecture, three hours; discussion, one hour. Honors course parallel to course 110B.", "pre-reqs": [], "co-reqs": []}, "MATH 105B": {"title": "Mathematics and Pedagogy for Teaching Secondary School Mathematics", "description": "Lecture, four hours; fieldwork, 30 minutes. Requisites: courses 105A, 110A (or 117), 120A (or 123), and 131A, with grades of C- or better. Mathematical knowledge and research-based pedagogy needed for teaching key polynomial, rational, and transcendental functions and related equations in secondary school; professional standards and current research for teaching secondary school mathematics. Letter grading.", "pre-reqs": ["MATH 131A", ["MATH 123", "MATH 120A"], ["MATH 110A", "MATH 117"], "MATH 105A"], "co-reqs": []}, "MATH 74XP": {"title": "Mathematics and Pedagogy for Teaching Elementary Mathematics", "description": "(Formerly numbered 74SL.) Seminar, two hours; fieldwork, two hours. Development of professional mathematical and pedagogical understandings required to teach California's K-5 mathematics curriculum. Exploration of K-5 mathematics, practice of effective teaching strategies for all learners, and discussion of current research and standards in mathematics education. Fieldwork in local mathematics classrooms (observation and presenting lesson plan) arranged by Cal Teach program. P/NP grading.", "pre-reqs": [], "co-reqs": []}, "MATH 32BH": {"title": "Calculus of Several Variables (Honors)", "description": "Lecture, three hours; discussion, one hour. Enforced requisites: courses 31B and 32A, with grades of B or better. Honors course parallel to course 32B. P/NP or letter grading.", "pre-reqs": ["MATH 31B", "MATH 32A"], "co-reqs": []}, "MATH 3B": {"title": "Calculus for Life Sciences Students", "description": "Lecture, three hours; discussion, one hour. Requisite: course 3A with grade of C- or better. Not open for credit to students with credit for course 31B. Applications of differentiation, integration, differential equations, linear models in biology, phase lines and classifying equilibrium values, bifurcations. P/NP or letter grading.", "pre-reqs": ["MATH 3A"], "co-reqs": []}}